oscillatingCylinder_openfoam10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       74082;
    }
    upperandlower
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          480;
        startFace       74242;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       74722;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          62;
        startFace       74882;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          74518;
        startFace       74944;
    }
)

// ************************************************************************* //
