oscillatingCylinder_openfoam10/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
    type            oscillatingDisplacement;

    amplitude       (0 0.05 0);
    omega            20.0;
    value           uniform (0 0 0);
    }

    frontAndBackPlanes
    {
        type            empty;
    }

    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
